package org.example.logistics_crm.user;

public enum UserRole {
    ADMIN,
    MANAGER,
    DISPATCHER,
    OPERATOR,
    PENDING
}

/* ADMIN
Повний доступ:
створення працівників
видалення працівників
управління ролями
перегляд всіх замовлень аналітика
системні налаштування

MANAGER
Робота з клієнтами:
створення замовлень
редагування замовлень
перегляд історії
фінансова частина
підтвердження замовлень

DISPATCHER
Логістика:
призначення водія
призначення truck
побудова маршруту
контроль доставки
зміна статусів доставки

OPERATOR
Початковий рівень:
прийом дзвінків
створення заявки
перегляд статусів
базова комунікація */

